In [2]:
import numpy as np
import pandas as pd

In [3]:
lst = [1,5,7,89]
pd.Series(lst)

0     1
1     5
2     7
3    89
dtype: int64

In [4]:
arr = np.array([1,5,8,9,7])
pd.Series(arr)

0    1
1    5
2    8
3    9
4    7
dtype: int32

In [5]:
pd.Series(index = ['Arnab', 'Rahul', 'Rakesh', 'Ashis'], data =[1,2,5,7])

Arnab     1
Rahul     2
Rakesh    5
Ashis     7
dtype: int64

In [6]:
steps ={'Arnab': 400, 'Rahul': 422, 'Exisrt':555,'Lovely': 686}
pd.Series(steps)

Arnab     400
Rahul     422
Exisrt    555
Lovely    686
dtype: int64

In [7]:
pd.Series(5).repeat(3)

0    5
0    5
0    5
dtype: int64

In [8]:
pd.Series(5).repeat(3).reset_index(drop = True)

0    5
1    5
2    5
dtype: int64

In [9]:
s = pd.Series([100,35]).repeat([5,2]).reset_index(drop = True)

s

0    100
1    100
2    100
3    100
4    100
5     35
6     35
dtype: int64

In [10]:
s[5]
s[2:-2]

2    100
3    100
4    100
dtype: int64

In [11]:
sr = pd.Series([1,2,3,4,5,6,7])
sr.agg([min,max,sum])

min     1
max     7
sum    28
dtype: int64

In [12]:
sr = pd.Series([1,-2,3,-4,5,-6,7])

sr.abs()

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [13]:
sr1 = pd.Series([1,-2,3])
sr2 = pd.Series([1,2,3])
sr3 = sr2.append(sr1)

sr3

C:\Users\adaka\AppData\Local\Temp\ipykernel_3736\3925069140.py:3: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  sr3 = sr2.append(sr1)

0    1
1    2
2    3
0    1
1   -2
2    3
dtype: int64

In [14]:
sr3.reset_index(drop = True)

0    1
1    2
2    3
3    1
4   -2
5    3
dtype: int64

In [15]:
sr1

0    1
1   -2
2    3
dtype: int64

In [16]:
type(sr1[0])

numpy.int64

In [17]:
sr1.astype('float')

0    1.0
1   -2.0
2    3.0
dtype: float64

In [18]:
sr1 = pd.Series([1,2,30,4,5,6,7,8,9,20])
sr1

0     1
1     2
2    30
3     4
4     5
5     6
6     7
7     8
8     9
9    20
dtype: int64

In [19]:
sr1.between(10,50)

0    False
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9     True
dtype: bool

In [20]:
ser = pd.Series(["Eshant Das" , "Data Science" , "Geeks for Geeks" , 'Hello World' , 'Machine Learning'])
print(ser.str.upper())
print('-'*30)
print(ser.str.lower())

0          ESHANT DAS
1        DATA SCIENCE
2     GEEKS FOR GEEKS
3         HELLO WORLD
4    MACHINE LEARNING
dtype: object
------------------------------
0          eshant das
1        data science
2     geeks for geeks
3         hello world
4    machine learning
dtype: object

In [21]:
for i in ser:
    print(len(i))

10
12
15
11
16

In [22]:
ser = pd.Series(["  Eshant Das" , "Data Science" , "Geeks for Geeks" , 'Hello World' , 'Machine Learning  '])

for i in ser:
    print(i , len(i))

  Eshant Das 12
Data Science 12
Geeks for Geeks 15
Hello World 11
Machine Learning   18

In [23]:
ser = ser.str.strip()

for i in ser:
    print(i , len(i))

Eshant Das 10
Data Science 12
Geeks for Geeks 15
Hello World 11
Machine Learning 16

In [24]:
ser.str.split()

0          [Eshant, Das]
1        [Data, Science]
2    [Geeks, for, Geeks]
3         [Hello, World]
4    [Machine, Learning]
dtype: object

In [25]:
ser.str.split()[0]

['Eshant', 'Das']

In [26]:
ser.str.split()[1]

['Data', 'Science']

In [27]:
ser = pd.Series(["Eshant Das","Data@Science"," for Geeks",'Hello@World','Machine Learning'])

ser.str.contains('@')

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [28]:
ser.str.replace('@',' ')

0          Eshant Das
1        Data Science
2           for Geeks
3         Hello World
4    Machine Learning
dtype: object

In [29]:

ser.str.count('a')

0    2
1    2
2    0
3    0
4    2
dtype: int64

In [30]:

ser.str.startswith('D')

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [31]:
ser.str.endswith('s')

0     True
1    False
2     True
3    False
4    False
dtype: bool

In [32]:
ser.str.find('Geeks')

0   -1
1   -1
2    5
3   -1
4   -1
dtype: int64

In [33]:

ser.to_list()

['Eshant Das', 'Data@Science', ' for Geeks', 'Hello@World', 'Machine Learning']

In [34]:
lst = ['Geeks', 'For', 'Geeks', 'is', 'portal', 'for', 'Geeks']

pd.DataFrame(lst)

        0
0   Geeks
1     For
2   Geeks
3      is
4  portal
5     for
6   Geeks

In [35]:
lst = [['tom',10],['jerry',12],['spike',14]]

pd.DataFrame(lst)

       0   1
0    tom  10
1  jerry  12
2  spike  14

In [36]:
data = {'name':['Tom', 'nick', 'krish', 'jack'], 'age':[20, 21, 19, 18]}


pd.DataFrame(data)

    name  age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

In [37]:
data = { 'Name'         :['Jai', 'Princi', 'Gaurav', 'Anuj'],
         'Age'          :[27, 24, 22, 32],
         'Address'      :['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
         'Qualification':['Msc', 'MA', 'MCA', 'Phd']}

df = pd.DataFrame(data)

df[['Name', 'Qualification']]

     Name Qualification
0     Jai           Msc
1  Princi            MA
2  Gaurav           MCA
3    Anuj           Phd

In [38]:
data = {'one'   : pd.Series([1, 2, 3, 4]),
        'two'   : pd.Series([10, 20, 30, 40]),
        'three' : pd.Series([100, 200, 300, 400]),
        'four'  : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [39]:
df.loc[1:2, 'two' : 'three']

   two  three
1   20    200
2   30    300

In [40]:

df.iloc[1 : -1, 1:-1 ]

   two  three
1   20    200
2   30    300

In [41]:
df.iloc[:,2:3]

   three
0    100
1    200
2    300
3    400

In [42]:
df.iloc[[0,2],[1,3]]

   two  four
0   10  1000
2   30  3000

In [43]:
df.loc[df['two'] > 20, ['three','four']]

   three  four
2    300  3000
3    400  4000

In [44]:

df.loc[df['three'] < 300, ['one','four']]

   one  four
0    1  1000
1    2  2000

In [45]:
df.loc[df['three'] < 300, ['one','four']]

   one  four
0    1  1000
1    2  2000

In [46]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [47]:
l = [22,33,44,55]
df['five'] = l
df

   one  two  three  four  five
0    1   10    100  1000    22
1    2   20    200  2000    33
2    3   30    300  3000    44
3    4   40    400  4000    55

In [48]:
sr = pd.Series([111,222,333,444])
df['six'] = sr
df

   one  two  three  four  five  six
0    1   10    100  1000    22  111
1    2   20    200  2000    33  222
2    3   30    300  3000    44  333
3    4   40    400  4000    55  444

In [49]:
df['seven'] = df['one'] + 10
df

   one  two  three  four  five  six  seven
0    1   10    100  1000    22  111     11
1    2   20    200  2000    33  222     12
2    3   30    300  3000    44  333     13
3    4   40    400  4000    55  444     14

In [50]:
df

   one  two  three  four  five  six  seven
0    1   10    100  1000    22  111     11
1    2   20    200  2000    33  222     12
2    3   30    300  3000    44  333     13
3    4   40    400  4000    55  444     14

In [51]:
del df['six']

df

   one  two  three  four  five  seven
0    1   10    100  1000    22     11
1    2   20    200  2000    33     12
2    3   30    300  3000    44     13
3    4   40    400  4000    55     14

In [52]:
df.pop('five')

df

   one  two  three  four  seven
0    1   10    100  1000     11
1    2   20    200  2000     12
2    3   30    300  3000     13
3    4   40    400  4000     14

In [53]:
df1 = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])


df3 = df1.append(df2).reset_index(drop = True)

df3

C:\Users\adaka\AppData\Local\Temp\ipykernel_3736\3894115464.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df3 = df1.append(df2).reset_index(drop = True)

   a  b
0  1  2
1  3  4
2  5  6
3  7  8

In [54]:
data = { 'one'   : pd.Series([1, 2, 3, 4]),
         'two'   : pd.Series([10, 20, 30, 40]),
         'three' : pd.Series([100, 200, 300, 400]),
         'four'  : pd.Series([1000, 2000, 3000, 4000])}


df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [55]:
df.drop([0,1], axis = 0, inplace = True)
df

   one  two  three  four
2    3   30    300  3000
3    4   40    400  4000

In [56]:
df.drop(['one','three'], axis = 1, inplace = True)
df

   two  four
2   30  3000
3   40  4000

In [57]:
data = { 'one'   : pd.Series([1, 2, 3, 4]),
         'two'   : pd.Series([10, 20, 30, 40]),
         'three' : pd.Series([100, 200, 300, 400]),
         'four'  : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [58]:

df.T

          0     1     2     3
one       1     2     3     4
two      10    20    30    40
three   100   200   300   400
four   1000  2000  3000  4000

In [59]:

df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [60]:
df.axes

[RangeIndex(start=0, stop=4, step=1),
 Index(['one', 'two', 'three', 'four'], dtype='object')]

In [61]:
df.ndim

2

In [62]:
df.dtypes

one      int64
two      int64
three    int64
four     int64
dtype: object

In [63]:
df.shape

(4, 4)

In [64]:
d = { 'Name'  :pd.Series(['Tom','Jerry','Spike','Popeye','Olive','Bluto','Mickey']),
      'Age'   :pd.Series([10,12,14,30,28,33,15]),
      'Height':pd.Series([3.25,1.11,4.12,5.47,6.15,6.67,2.61])}

df = pd.DataFrame(d)
df

     Name  Age  Height
0     Tom   10    3.25
1   Jerry   12    1.11
2   Spike   14    4.12
3  Popeye   30    5.47
4   Olive   28    6.15
5   Bluto   33    6.67
6  Mickey   15    2.61

In [65]:
df.head(3)

    Name  Age  Height
0    Tom   10    3.25
1  Jerry   12    1.11
2  Spike   14    4.12

In [66]:

df.tail(3)

     Name  Age  Height
4   Olive   28    6.15
5   Bluto   33    6.67
6  Mickey   15    2.61

In [67]:
df = pd.DataFrame()

df.empty

True

In [68]:
data = {'one'   : pd.Series([1, 2, 3, 4]),
        'two'   : pd.Series([10, 20, 30, 40]),
        'three' : pd.Series([100, 200, 300, 400]),
        'four'  : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [71]:
df.sum()
# df.mean()
# df.median()
# df.var()
# df.min()
# df.max()
# df.std()

one         10
two        100
three     1000
four     10000
dtype: int64

In [70]:
de = pd.DataFrame({'A': [1, 2, 2, 3, 4, 4, 4, 5], 'B': [10, 20, 20, 30, 40, 40, 50, 60]})

print('A' , de['A'].mode())
print('B' , de['B'].mode())

A 0    4
Name: A, dtype: int64
B 0    20
1    40
Name: B, dtype: int64

In [72]:
data = {'one'  : pd.Series([1, 2, 3, 4]),
        'two'  : pd.Series([10, 20, 30, 40]),
        'three': pd.Series([100, 200, 300, 400]),
        'four' : pd.Series([1000, 2000, 3000, 4000]),
        'five' : pd.Series(['A','B','C','D'])}


df = pd.DataFrame(data)

df.describe()

            one        two       three         four
count  4.000000   4.000000    4.000000     4.000000
mean   2.500000  25.000000  250.000000  2500.000000
std    1.290994  12.909944  129.099445  1290.994449
min    1.000000  10.000000  100.000000  1000.000000
25%    1.750000  17.500000  175.000000  1750.000000
50%    2.500000  25.000000  250.000000  2500.000000
75%    3.250000  32.500000  325.000000  3250.000000
max    4.000000  40.000000  400.000000  4000.000000

In [73]:
data = {'one'  : pd.Series([1, 2, 3, 4]),
        'two'  : pd.Series([10, 20, 30, 40]),
        'three': pd.Series([100, 200, 300, 400]),
        'four' : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [74]:
def add_(i,j):
    return i + j

df.pipe(add_, 10)

   one  two  three  four
0   11   20    110  1010
1   12   30    210  2010
2   13   40    310  3010
3   14   50    410  4010

In [75]:
def mean_(col):
    return col.mean()

def square(i):
    return i ** 2

df.pipe(mean_).pipe(square)

one            6.25
two          625.00
three      62500.00
four     6250000.00
dtype: float64

In [77]:
data = {'one'  : pd.Series([1, 2, 3, 4]),
        'two'  : pd.Series([10, 20, 30, 40]),
        'three': pd.Series([100, 200, 300, 400]),
        'four' : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
df

print(df.apply(np.mean))

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [78]:
df.apply(lambda x: x.max() - x.min())

one         3
two        30
three     300
four     3000
dtype: int64

In [79]:
df.applymap(lambda x : x*100)

   one   two  three    four
0  100  1000  10000  100000
1  200  2000  20000  200000
2  300  3000  30000  300000
3  400  4000  40000  400000

In [80]:
df = pd.DataFrame({ 'A': [1.2, 3.4, 5.6], 
                    'B': [7.8, 9.1, 2.3]})

df_1 = df.applymap(np.int64)
print(df_1)

df_2 = df.apply(lambda row : row.mean(), axis = 0)
print(df_2)

   A  B
0  1  7
1  3  9
2  5  2
A    3.4
B    6.4
dtype: float64

In [81]:


data = { 'one'   : pd.Series([1, 2, 3, 4]),
         'two'   : pd.Series([10, 20, 30, 40]),
         'three' : pd.Series([100, 200, 300, 400]),
         'four'  : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)

print(df)
print('-'*30)
print(df.reindex([1,0,3,2]))

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000
------------------------------
   one  two  three  four
1    2   20    200  2000
0    1   10    100  1000
3    4   40    400  4000
2    3   30    300  3000

In [82]:
data = {'Name' : ['John', 'Jane', 'Jim', 'Joan'],
        'Age'  : [25, 30, 35, 40],
        'City' : ['New York', 'Los Angeles', 'Chicago', 'Houston']}

df = pd.DataFrame(data)

df.reindex(columns = ['Name','City','Age'])

   Name         City  Age
0  John     New York   25
1  Jane  Los Angeles   30
2   Jim      Chicago   35
3  Joan      Houston   40

In [83]:
data = { 'one'   : pd.Series([1, 2, 3, 4]),
         'two'   : pd.Series([10, 20, 30, 40]),
         'three' : pd.Series([100, 200, 300, 400]),
         'four'  : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)

df.rename(columns = {'one' : 'One','two': 'Two', 'three' : 'Three', 'four' : 'Four'}, 
           inplace = True, index = {0:'a',1:'b',2:'c',4:'d'})
df

   One  Two  Three  Four
a    1   10    100  1000
b    2   20    200  2000
c    3   30    300  3000
3    4   40    400  4000

In [84]:

data = { 'one'   : pd.Series([11, 51, 31, 41]),
         'two'   : pd.Series([10, 20, 30, 40]),
         'three' : pd.Series([100, 200, 500, 400]),
         'four'  : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
df
df.sort_values(by = 'one')
df.sort_values(by = 'one', ascending = False)

   one  two  three  four
1   51   20    200  2000
3   41   40    400  4000
2   31   30    500  3000
0   11   10    100  1000

In [85]:
df.sort_values(by = ['one','two'])
df.sort_values(by = ['one'], kind = 'healsort')

   one  two  three  four
0   11   10    100  1000
2   31   30    500  3000
3   41   40    400  4000
1   51   20    200  2000

In [86]:
cricket = {'Team'   : ['India', 'India', 'Australia', 'Australia', 'SA', 'SA', 'SA', 'SA', 'NZ', 'NZ', 'NZ', 'India'],
           'Rank'   : [2, 3, 1,2, 3,4 ,1 ,1,2 , 4,1,2],
           'Year'   : [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
           'Points' : [876,801,891,815,776,784,834,824,758,691,883,782]}

df = pd.DataFrame(cricket)
df

         Team  Rank  Year  Points
0       India     2  2014     876
1       India     3  2015     801
2   Australia     1  2014     891
3   Australia     2  2015     815
4          SA     3  2014     776
5          SA     4  2015     784
6          SA     1  2016     834
7          SA     1  2017     824
8          NZ     2  2016     758
9          NZ     4  2014     691
10         NZ     1  2015     883
11      India     2  2017     782

In [87]:

df.groupby('Team').groups
df.groupby(['Team','Year']).get_group(('Australia',2014))
df.groupby('Team').sum()['Points']
df.groupby('Team').sum()['Points'].sort_values(ascending = False)
groups = df.groupby('Team')

groups['Points'].agg([np.sum, np.mean, np.std,np.max,np.min])
df.groupby('Team').filter(lambda x : len(x) == 4)

  Team  Rank  Year  Points
4   SA     3  2014     776
5   SA     4  2015     784
6   SA     1  2016     834
7   SA     1  2017     824